# RENAMING COLOUMNS

In [1]:
import pandas as pd
ufo=pd.read_csv("pandas-videos-master/data/ufo.csv")
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### In order to just look at the coloumn names

In [2]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [5]:
ufo.rename(columns={"Colors Reported":"colors_reported" , "Shape Reported":"shape_reported"},inplace=True)

In [7]:
ufo.head()

                   City colors_reported shape_reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### or

In [8]:
#create a list of col_names
col_names=['city','colors_reported','shape_reported','State','Time']
ufo.columns=col_names
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'State', 'Time'], dtype='object')

### or

In [10]:
# we can change col_names while reading the csv file as well
col_names=['city','colors_reported','shape_reported','State','Time']
ufo=pd.read_csv("pandas-videos-master/data/ufo.csv",names=col_names)
ufo.head()

          city  colors_reported  shape_reported  State             Time
0         City  Colors Reported  Shape Reported  State             Time
1       Ithaca              NaN        TRIANGLE     NY   6/1/1930 22:00
2  Willingboro              NaN           OTHER     NJ  6/30/1930 20:00
3      Holyoke              NaN            OVAL     CO  2/15/1931 14:00
4      Abilene              NaN            DISK     KS   6/1/1931 13:00

## IN ORDER TO REPLACES SPACES OR SOME CHARACTERS FROM COLOUMNS WE CAN DIRECTLY USE--

In [15]:
ufo=pd.read_csv("pandas-videos-master/data/ufo.csv")
ufo.columns=ufo.columns.str.replace(' ','_')
ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00